app/controllers/platforms_controller.rb

SELECT "platforms".* FROM "platforms"
---
  def index
    platforms = Platform.all